/*
*********************************************************************************************************
*
*    模块名称 : USB接口模块
*    文件名称 : usb_if.h
*
*********************************************************************************************************
*/

#ifndef _USB_IF_H_
#define _USB_IF_H_

#include "teeny_usb.h"
#include "tusbd_user.h"
#include "tusbd_hid.h"
#include "tusbd_cdc.h"
#include "tusbd_msc.h"

#endif

/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/
