/*
*********************************************************************************************************
*
*    模块名称 : 图片资源模块。
*    文件名称 : image.c
*    版    本 : V2.0
*    说    明 : 图片数据
*    修改记录 :
*        版本号  日期       作者    说明
*        v2.0    2011-10-16 armfly  创建
*
*    Copyright (C), 2010-2012, 安富莱电子
*
*********************************************************************************************************
*/

#include "stm32f4xx.h"

#include "QQ.c"
#include "UDisk.c"
#include "SIM.c"
#include "Bat.c"
#include "Spk.c"










