/*
*********************************************************************************************************
*
*    模块名称 : lua 寄存器操作模块
*    文件名称 : lua_reg_register.h
*    版    本 : V1.0
*    说    明 : 。
*    修改记录 :
*        版本号  日期       作者    说明
*        v1.0    2019-10-15 armfly  首发
*
*    Copyright (C), 2019-2030, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/

#ifndef __LUA_REG_REGISTER_H
#define __LUA_REG_REGISTER_H

void lua_reg_RegisterFun(void);

#endif

/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/
