/*
*********************************************************************************************************
*
*    模块名称 : lua 串口模块
*    文件名称 : lua_if_uart.h
*    说    明 : 头文件
*
*    Copyright (C), 2019-2030, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/

#ifndef __LUA_IF_UART_H
#define __LUA_IF_UART_H

void lua_uart_RegisterFun(void);

#endif

/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/
