/*
*********************************************************************************************************
*
*    模块名称 : lua i2c模块
*    文件名称 : lua_i2c.h
*    版    本 : V1.0
*    说    明 : 。
*    修改记录 :
*        版本号  日期       作者    说明
*        v1.0    2019-07-03 armfly  ST固件库版本 V2.1.0
*
*    Copyright (C), 2019-2030, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/

#ifndef __LUA_I2C_H
#define __LUA_I2C_H

void lua_i2c_RegisterFun(void);

#endif

/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/
