/*
*********************************************************************************************************
*
*    模块名称 : USB Device接口模块
*    文件名称 : usbd_usr.h
*    版    本 : V1.0
*
*********************************************************************************************************
*/

#ifndef __USBD_USR_H__
#define __USBD_USR_H__

void usbd_OpenMassStorage(void);
void usbd_CloseMassStorage(void);

#endif

/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/

