//*
//*********************************************************************************************************
//*
//*                                                 LOGO
//*
//*
//* 文 件 名 : CreateMultiTask.c
//*
//* 文件描述 : 所有用户级任务都有本函数初次建立
//*
//* 作    者 : 
//* 版    本 : 
//* 编 译 器 : IAR EWARM 5.20
//*********************************************************************************************************
//*

#include "app_cfg.h"

//
//*********************************************************************************************************
//** 函数名称: void  CreateMultiTask (void)
//**
//** 功能描述: 
//**
//** 作　  者: 
//**
//** 日　  期:
//**-------------------------------------------------------------------------------------------------------
//** 修 改 人:
//** 日　  期:
//** 描    述:
//**------------------------------------------------------------------------------------------------------
//*********************************************************************************************************
//
void  CreateMultiTask (void)
{
    //INT8U  err;
    
    //*********************************************************************************************************
    //**********************************  
    //*********************************************************************************************************
    //建立任务
    /*OSTaskCreateExt(AppTask_MENU,
                    (void *)0,
                    &AppTaskMENU_Stk[APP_TASK_MENU_STK_SIZE - 1],
                    APP_TASK_MENU_PRIO,
                    APP_TASK_MENU_ID,
                    &AppTaskMENU_Stk[APP_TASK_MENU_STK_SIZE_HARD],
                    OSTaskStkSize - OSTaskStkSizeHard,
                    (void *)0,
                    OS_TASK_OPT_STK_CHK | OS_TASK_OPT_STK_CLR);
    //设置任务名称
    OSTaskNameSet(APP_TASK_MENU_PRIO, "AppTask-MENU", &err);*/
    
    //*********************************************************************************************************
    //************************************** 
    //*********************************************************************************************************
    //建立任务
    /*OSTaskCreateExt(AppTask_USB,
                    (void *)0,
                    &AppTaskUSB_Stk[APP_TASK_USB_STK_SIZE - 1],
                    APP_TASK_USB_PRIO,
                    APP_TASK_USB_ID,
                    &AppTaskUSB_Stk[APP_TASK_USB_STK_SIZE_HARD],
                    OSTaskStkSize - OSTaskStkSizeHard,
                    (void *)0,
                    OS_TASK_OPT_STK_CHK | OS_TASK_OPT_STK_CLR);
    //设置任务名称
    OSTaskNameSet(APP_TASK_USB_PRIO, "AppTask-USB", &err);*/
}
