/*
*********************************************************************************************************
*
*    模块名称 : TIM定时DMA操作模块
*    文件名称 : bsp_tim_dma.h
*    版    本 : V1.0
*    说    明 : 头文件
*
*    Copyright (C), 2019-2020, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/

#ifndef __BSP_TIM_DMA_H
#define __BSP_TIM_DMA_H

void bsp_InitTimDMA1(void);

#endif

/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/
