/*
*********************************************************************************************************
*
*    模块名称 : 示波器模块74HC595扩展输出口驱动模块
*    文件名称 : bsp_74hc595_io.c
*    版    本 : V1.0
*    说    明 : 使用74HC595扩展8个输出口
*
*    Copyright (C), 2015-2020, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/

#ifndef _BSP_74HC595_IO_H
#define _BSP_74HC595_IO_H

void HC595_InitHard(void);
void HC595_WriteGPIO(uint8_t _pin, uint8_t _value);
void HC595_LockData(void);

#endif

