/*
*********************************************************************************************************
*
*	模块名称 : DS18B20 驱动模块(1-wire 数字温度传感器）
*	文件名称 : bsp_ds18b20.h
*
*	Copyright (C), 2020, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/

#ifndef _BSP_DS18B20_H
#define _BSP_DS18B20_H

uint8_t DS18B20_ReadTemp(uint8_t _ch, float *_result);

#endif

/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/
