/*
*********************************************************************************************************
*
*    模块名称 : MODBUS 处理PC机发送的消息(无需应答）
*    文件名称 : modbus_msg.c
*    版    本 : V1.0
*    说    明 : 实现虚拟操作，模拟按键. 预留暂时未用
*
*    Copyright (C), 2020, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/

#include "Includes.h"
#include "modbus_slave.h"

/*
*********************************************************************************************************
*    函 数 名: MODS_70H
*    功能说明: 处理PC机消息，无需应答
*    形    参: 无
*    返 回 值: 无
*********************************************************************************************************
*/
void MODS_70H(void)
{
    /*
        主机发送:  
            01  ; 站号
            70  ; 功能码
            0000  ; 寄存器地址
            0000  ; 寄存器数量
            0000  ; 寄存器值
            CCCC      : CRC16
    
        从机应答: 无
    */    
//    uint16_t reg;       
//    uint16_t num;
//    uint16_t value;
//      
//    reg = BEBufToUint16(&g_tModS.RxBuf[2]);
//    num = BEBufToUint16(&g_tModS.RxBuf[4]);
//    value = BEBufToUint32(&g_tModS.RxBuf[6]);

    /*  无应答 */
    g_tModS.TxCount = 0;    
}

/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/
